"""
Создать телефонный справочник с возможностью импорта и экспорта данных в формате .txt.
Фамилия, имя, отчество, номер телефона - данные, которые должны находиться в файле.

1. Программа должна выводить данные
2. Программа должна сохранять данные в текстовом файле
3. Пользователь может ввести одну из характеристик для поиска определенной записи
  (Например имя или фамилию человека)
4. Использование функций. Ваша программа не должна быть линейной

Программа должна быть разделена на несколько файлов.
В первом файле под названием start_menu_1.py должны быть описаны пункты меню на выбор:
1. Открыть файл
2. Сохранить файл
3. Показать контакты
4. Добавить контакт
5. Изменить контакт
6. Найти контакт
7. Удалить контакт
8. Выход

Во втором файле под названием config_1.py должны быть описаны функции отвечающие каждому пункту меню
"""






















